app/Controllers/AuthController.php

SELECT *
FROM `user`
WHERE `username` = 'jonn'
 LIMIT 1
---
		    public function login()
		    {
		        if ($this->request->getPost()) {
		            $username = $this->request->getVar('username');
		            $password = $this->request->getVar('password');

		            $dataUser = $this->user->where(['username' => $username])->first();

INSERT INTO `user` (`username`, `password`) VALUES ('farikha', '202cb962ac59075b964b07152d234b70')
---
			public function register()
			{
				if ($this->request->getPost()) {
					$username = $this->request->getVar('username');
					$password = md5($this->request->getVar('password'));
					$email = $this->request->getVar('email');

					$data = [
						'username' => $username,
						'password' => $password,
						'email' => $email
					];

					$this->user->insert($data);